{
  "INTERNAL_SERVER_ERROR": "An internal server error has occurred.",
  "RECORD_CREATED": "The record has been created successfully",
  "RECORD_UPDATED": "The record has been updated successfully",
  "RECORD_DELETED": "The record has been deleted successfully",
  "RECORD_FETCHED": "The record has been fetched successfully",
  "RECORD_DOES_NOT_EXISTS": "The record does not exist",
  "RECORD_ALREADY_EXISTS": "The record already exists",
  "UNAUTHORIZED": "Unauthorized!",
  "SESSION_EXPIRE": "Your session is expired, please login again",
  "FORBIDDEN": "You do not authorization for accessing this module",
  "UNABLE_TO_VERIFY_REQUEST_DATA": "Something went wrong, please try again later or contact us!",
  "LOGIN_SUCCESSFULLY": "Loggedin Successfully",
  "LOGOUT_SUCCESSFULLY": "Logged out Successfully",
  "OLD_PASSWORD_INCORRECT": "Old Password Is Incorrect",
  "PASSWORD_RESET_SUCCESSFULLY": "Password Reset Successfully!",
  "FORGOT_PASSWORD_SUCCESS": "New password link has been sent to your email",
  "FORGOT_PASSWORD_SET_NEW_FAILED": "Failed to set a new password",
  "FORGOT_PASSWORD_SET_NEW_SUCCESS": "You have successfully set a new password",
  "USER_CREATED_SUCCESSFULLY": "User created successfully",
  "USER_UPDATED_SUCCESSFULLY": "User updated successfully",
  "COUNTRY_NAME_EXISTS": "Country name is already exists",
  "COUNTRY_CODE_EXISTS": "Country code is already exists",
  "SLUG_EXISTS": "Slug is already exists",
  "COLOR_CODE_EXISTS": "Color code is already exists",
  "PRODUCT_TYPE_EXISTS": "Product type is already exists",
  "GENDER_ALREADY_EXISTS": "Gender is already exists",
  "USER_DOES_NOT_EXIST": "User does not exists",
  "UNABLE_TO_CREATE_USER": "Unable to create user",
  "UNABLE_TO_UPDATE_USER": "Unable to update user",
  "EMAIL_NOT_VERIFIED": "Email is not verified",
  "MOBILE_NUMBER_EXISTS": "Mobile number is already exists",
  "EMAIL_EXISTS": "Email is already exists",
  "INVALID_USER_CRED": "Invalid credentials",
  "ACCOUNT_SUSPENDED": "Your account has been suspended",
  "EMAIL_VERIFICATION_MAIL": "Your email address is not verified yet. Please check your inbox and follow the link we sent to complete your registration",
  "EMAIL_VERIFICATION_SUCCESS": "Your email has been successfully verified! You can now log in and start using your account",
  "EMAIL_VERIFICATION_FAILED": "The verification link has expired. Please log in again to receive a new verification email",
  "EMAIL_ALREADY_VERIFIED": "Your email address has already been verified! You can log in to your account",
  "INVALID_MULTILINGUAL_DATA": "The multilingual data provided is invalid or incorrectly formatted. Please ensure each language entry includes valid fields and try again",
  "PLEASE_DISABLE_SUB_CATEGORY_TO_DISABLE_MAIN_CATEGORY": "To disable the main category, please ensure all associated subcategories are disabled first",
  "PLEASE_DISABLE_PRODUCTS_TO_DISABLE_MAIN_CATEGORY": "To disable the main category, please ensure all associated products are disabled first",
  "PLEASE_DISABLE_PRODUCTS_AND_SUB_CATEGORY_TO_DISABLE_MAIN_CATEGORY": "To disable the main category, please ensure all associated products and subcategories are disabled first",
  "PLEASE_DISABLE_CHILD_CATEGORY_TO_DISABLE_SUB_CATEGORY": "To disable the subcategory, please ensure all associated child categories are disabled first",
  "PLEASE_DISABLE_PRODUCTS_TO_DISABLE_SUB_CATEGORY": "To disable the subcategory, please ensure all associated products are disabled first",
  "PLEASE_DISABLE_PRODUCTS_AND_CHILD_CATEGORY_TO_DISABLE_SUB_CATEGORY": "To disable the subcategory, please ensure all associated products and child categories are disabled first",
  "PLEASE_DISABLE_SUB_CHILD_CATEGORY_TO_DISABLE_CHILD_CATEGORY": "To disable the child category, please ensure all associated sub-child categories are disabled first",
  "PLEASE_DISABLE_PRODUCTS_TO_DISABLE_CHILD_CATEGORY": "To disable the child category, please ensure all associated products are disabled first",
  "PLEASE_DISABLE_PRODUCTS_AND_SUB_CHILD_CATEGORY_TO_DISABLE_CHILD_CATEGORY": "To disable the child category, please ensure all associated products and sub-child categories are disabled first",
  "PLEASE_DISABLE_PRODUCTS_TO_DISABLE_SUB_CHILD_CATEGORY": "To disable the sub child category, please ensure all associated products are disabled first",
  "JOI_ERROR_REQUIRED_SLUG": "Slug is Required",
  "JOI_ERROR_INVALID_SLUG": "Slug is Invalid",
  "JOI_ERROR_REQUIRED_GENDER": "Gender is Required",
  "JOI_ERROR_INVALID_GENDER": "Gender is Invalid",
  "JOI_ERROR_ANY_ONLY_STATUS": "Status must be either true or false",
  "JOI_ERROR_TYPE_STATUS": "Status must be a boolean",
  "JOI_ERROR_REQUIRED_STATUS": "Status is Required",
  "JOI_ERROR_REQUIRED_MAIN_CATEGORY": "Main Category is Required",
  "JOI_ERROR_INVALID_MAIN_CATEGORY": "Main Category is Invalid",
  "JOI_ERROR_REQUIRED_SUB_CATEGORY": "Sub Category is Required",
  "JOI_ERROR_INVALID_SUB_CATEGORY": "Sub Category is Invalid",
  "JOI_ERROR_REQUIRED_CHILD_CATEGORY": "Child Category is Required",
  "JOI_ERROR_INVALID_CHILD_CATEGORY": "Child Category is Invalid",
  "JOI_ERROR_REQUIRED_SUB_CHILD_CATEGORY": "Sub Child Category is Required",
  "JOI_ERROR_INVALID_SUB_CHILD_CATEGORY": "Sub Child Category is Invalid",
  "JOI_ERROR_REQUIRED_SIZE": "Size is Required",
  "JOI_ERROR_INVALID_SIZE": "Size is Invalid",
  "JOI_ERROR_REQUIRED_PRODUCT_TYPE_CATEGORY": "Product Type Category is Required",
  "JOI_ERROR_INVALID_PRODUCT_TYPE_CATEGORY": "Product Type Category is Invalid",
  "JOI_ERROR_REQUIRED_PRICE": "Price is Required",
  "YARN_ID_ALREADY_EXISTS": "Yarn id is already exists",
  "PLEASE_DELETE_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Yarn module before proceeding to delete gender.",
  "PLEASE_DELETE_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_CHILD_CATEGORY_SUB_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Child Category, Sub Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_CHILD_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Child Category, Sub Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Child Category, Sub Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Child Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_SUB_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Sub Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Sub Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Sub Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Child Category, Sub Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Child Category, Sub Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Child Category, Sub Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Sub Category, Child Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Child Category, Sub Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Child Category, Sub Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Child Category, Sub Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Child Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_SUB_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Sub Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Sub Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Sub Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Child Category, Sub Child Category modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Child Category, Sub Child Category, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Child Category, Sub Child Category, Yarn modules before proceeding to delete gender.",
  "PLEASE_DELETE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DELETE_GENDER": "Please first delete the gender references from the Main Category, Sub Category, Child Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to delete gender.",
  "PLEASE_DISABLE_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Yarn module before proceeding to disable gender.",
  "PLEASE_DISABLE_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_CHILD_CATEGORY_SUB_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Child Category, Sub Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_CHILD_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Child Category, Sub Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Child Category, Sub Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Child Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_SUB_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Sub Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Sub Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Sub Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Child Category, Sub Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Child Category, Sub Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Child Category, Sub Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Sub Category, Child Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Child Category, Sub Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Child Category, Sub Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Child Category, Sub Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Child Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_SUB_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Sub Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Sub Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Sub Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Child Category, Sub Child Category modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Child Category, Sub Child Category, Pre Registration modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Child Category, Sub Child Category, Yarn modules before proceeding to disable gender.",
  "PLEASE_DISABLE_MAIN_CATEGORY_SUB_CATEGORY_CHILD_CATEGORY_SUB_CHILD_CATEGORY_YARN_PRE_REGISTRATION_TO_DISABLE_GENDER": "Please first disable the gender references from the Main Category, Sub Category, Child Category, Sub Child Category, Yarn, Pre Registration modules before proceeding to disable gender.",

  "PLEASE_DELETE_YARN_TO_DELETE_COLOUR": "Please first delete the colour references from the Yarn module before proceeding to delete colour.",
  "PLEASE_DISABLE_YARN_TO_DISABLE_COLOUR": "Please first disable the colour references from the Yarn module before proceeding to disable colour.",
  "PLEASE_DELETE_YARN_TO_DELETE_MATERIAL": "Please first delete the material references from the Yarn module before proceeding to delete material.",
  "PLEASE_DISABLE_YARN_TO_DISABLE_MATERIAL": "Please first disable the material references from the Yarn module before proceeding to disable material.",
  "PLEASE_DELETE_YARN_TO_DELETE_OCCASSION": "Please first delete the occassion references from the Yarn module before proceeding to delete occassion.",
  "PLEASE_DISABLE_YARN_TO_DISABLE_OCCASSION": "Please first disable the occassion references from the Yarn module before proceeding to disable occassion.",
  "PLEASE_DELETE_YARN_TO_DELETE_PATTERN": "Please first delete the pattern references from the Yarn module before proceeding to delete pattern.",
  "PLEASE_DISABLE_YARN_TO_DISABLE_PATTERN": "Please first disable the pattern references from the Yarn module before proceeding to disable pattern.",
  "PLEASE_DELETE_YARN_TO_DELETE_PERCEIVED_WEIGHT": "Please first delete the perceived weight references from the Yarn module before proceeding to delete perceived weight.",
  "PLEASE_DISABLE_YARN_TO_DISABLE_PERCEIVED_WEIGHT": "Please first disable the perceived weight references from the Yarn module before proceeding to disable perceived weight.",
  "PLEASE_DELETE_YARN_TO_DELETE_SEASONALITY": "Please first delete the seasonality references from the Yarn module before proceeding to delete seasonality.",
  "PLEASE_DISABLE_YARN_TO_DISABLE_SEASONALITY": "Please first disable the seasonality references from the Yarn module before proceeding to disable seasonality.",
  "PLEASE_DISABLE_STEP_CARD_TO_DELETE_IT": "Please first disable the step card entry to delete it",
  "PLEASE_DELETE_STEP_CARD_TO_DELETE_STEP_TYPE": "Please first delete the step type references from the step card module before proceeding to delete step type."
}
